Study2/src/Documents/УценкаТовара/УценкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УценкаТовара</name>
  <registerRecords>AccumulationRegister.УценкаТовара</registerRecords>
  <registerRecords>InformationRegister.СведенияОбУцененномТоваре</registerRecords>
  <registerRecords>InformationRegister.ЦеныНаУцененныйТовар</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>SN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена нового товара</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <comment>Новая цена на уценённый товар</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/Documents/УценкаТовара/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ВставитьРазделительСтраниц = Ложь;
Если (Ложь) Тогда
ТабДок = Новый ТабличныйДокумент;
КонецЕсли;

Для Каждого СсылкаНаДокумент из Ссылка Цикл
Если (ВставитьРазделительСтраниц) Тогда 
ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецЕсли;

Макет = Документы.УценкаТовара.ПолучитьМакет("Печать");

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
ОбластьСостав = Макет.ПолучитьОбласть("Состав");
ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

ОбластьЗаголовок.Параметры.Дата = СсылкаНаДокумент.Дата;
ОбластьЗаголовок.Параметры.НомерДокумента = СсылкаНаДокумент.Номер;

ОбластьШапка.Параметры.Заполнить(СсылкаНаДокумент);

ТабДок.Вывести(ОбластьЗаголовок);
ТабДок.Вывести(ОбластьШапка);
ТабДок.Вывести(ОбластьСоставШапка);

Для Каждого СтрокаСписка Из СсылкаНаДокумент.Состав Цикл
ОбластьСостав.Параметры.Заполнить(СтрокаСписка);
ОбластьСостав.Параметры.РазницаЦен = СтрокаСписка.НоваяЦена - СтрокаСписка.Цена; 
ТабДок.Вывести(ОбластьСостав);
КонецЦикла;

ОбластьПодвал.Параметры.Заполнить(СсылкаНаДокумент);
ТабДок.Вывести(ОбластьПодвал);

ВставлятьРазделительСтраниц = Истина;
КонецЦикла;

КонецПроцедуры
